/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Der Vorgang konnte nicht abgeschlossen werden";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Ein unbekannter Fehler ist aufgetreten (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Vorgang kann nicht abgeschlossen werden";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Versuchen Sie es später erneut.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Aufnahme fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Versuchen Sie die Aufnahme erneut.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Aufnahme fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Halten Sie alle anderen Vorgänge, die %@ verwenden, an und versuchen Sie es erneut."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Aufnahme fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Versuchen Sie die Aufnahme erneut.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Versuchen Sie die Aufnahme erneut.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Nicht genügend Speicherplatz. Löschen Sie Videos oder Fotos, damit Sie das Schreiben der Dateien fortsetzen können.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Versuchen Sie die Aufnahme erneut.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Versuchen Sie die Aufnahme erneut.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Die Aufnahme hat die maximale Länge erreicht."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Die Aufnahme hat die maximale Dateigröße erreicht."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Halten Sie alle anderen Vorgänge, die das Aufnahmegerät verwenden, an und versuchen Sie es erneut.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Die Aufnahme hat die maximale Länge erreicht."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Aufnahme fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Versuchen Sie die Aufnahme erneut.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@ kann nicht benutzt werden"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Halten Sie alle anderen Vorgänge, die %@ verwenden, an und versuchen Sie es erneut."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@ kann nicht benutzt werden"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Halten Sie alle anderen Vorgänge, die %@ verwenden, an und versuchen Sie es erneut."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Aufnahme gestoppt";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Halten Sie alle anderen Vorgänge, die das Aufnahmegerät verwenden, an und versuchen Sie es erneut.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Die Taschenlampe konnte nicht eingeschaltet werden.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Versuchen Sie, die Taschenlampe auf niedrigerer Stufe einzuschalten.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Vorgang kann nicht abgeschlossen werden";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Versuchen Sie es später erneut.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Export kann nicht abgeschlossen werden";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Versuchen Sie den Export erneut.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Dekodieren fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Die Mediendaten konnten nicht dekodiert werden. Sie sind möglicherweise beschädigt.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Das Medienformat wird nicht unterstützt.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Sichern fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Versuchen Sie das Sichern erneut.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Ausgabedatei kann nicht geschrieben werden";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Ändern Sie die Ausgabeerweiterung und versuchen Sie es erneut.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Diese Mediendatei kann nicht verwendet werden.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Diese Mediendatei kann nicht verwendet werden.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Diese Mediendatei kann nicht verwendet werden.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Diese Mediendatei kann nicht verwendet werden.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Das Medienformat wird nicht unterstützt.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Diese Mediendatei ist möglicherweise beschädigt.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Fotoaufnahme fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Versuchen Sie die Fotoaufnahme erneut.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Der Vorgang wird für geschützten Inhalt nicht unterstützt."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Dieser Inhalt ist nicht autorisiert."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Die App ist zur Wiedergabe der Datei nicht autorisiert."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Diese Mediendatei kann nicht verwendet werden.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Dekodieren fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Der für diese Mediendatei erforderliche Dekodierer wurde nicht gefunden.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Kodieren fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Der für diese Mediendatei erforderliche Kodierer wurde nicht gefunden.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Dekodieren fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Der für diese Mediendatei erforderliche Dekodierer ist beschäftigt.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Halten Sie alle anderen Vorgänge, die Medien dekodieren, an und versuchen Sie es erneut.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Kodieren fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Der für diese Mediendatei erforderliche Kodierer ist beschäftigt.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Halten Sie alle anderen Vorgänge, die Medien kodieren, an und versuchen Sie es erneut.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@ kann nicht benutzt werden"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Im Hintergrund laufende Apps dürfen folgendes Gerät nicht benutzen: %@"; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Der Vorgang wird für dieses Medium nicht unterstützt.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Das Video konnte nicht gemäß der Anweisungen erstellt werden.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Diese Mediendatei kann nicht verwendet werden.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Die Cache-Datei an der Download-URL kann nicht verwendet werden.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Die Prüfsumme der Datei ist ungültig.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Vorgang unterbrochen";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Stoppen Sie andere Vorgänge und versuchen Sie es erneut.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Öffnen fehlgeschlagen";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Die Mediendatei kann auf diesem Gerät nicht verwendet werden.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Diese Mediendatei ist möglicherweise beschädigt.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Vorgang gestoppt";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Der Server ist nicht ordnungsgemäß konfiguriert.";
